Application/app/controllers/articles_controller.rb

  def create
    @user = User.find(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]