Application/app/controllers/products_controller.rb

  def index
    @user = User.find_by_id(session[:id])
    @products = @user.products.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 248], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", 248]]

  def marketplace
    @tags = Tag.all
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @user = User.find_by_id(session[:id])
    product_params = params.require(:product).permit(:title, :image, :price, :tag_list, :tag, { tag_ids: [] }, :tag_ids, :quantity)
    @product = @user.products.new(product_params)

    respond_to do |format|
      if @product.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "products" ("title", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Backpack"], ["price", 45], ["user_id", 6], ["created_at", "2022-02-03 20:41:58.939386"], ["updated_at", "2022-02-03 20:41:58.939386"]]

  def update
    product_params = params.require(:product).permit(:title, :image, :price, :tag_list, :tag, { tag_ids: [] }, :tag_ids, :quantity)
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = $1, "updated_at" = $2, "price" = $3 WHERE "products"."id" = $4  [["title", "test2"], ["updated_at", "2022-01-30 23:30:52.569911"], ["price", 109000], ["id", 91]]

  def destroy
    @user = User.find_by_id(session[:id])
    @product = @user.products.find(params[:id])
    @product.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]