Application/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test3@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(username: params[:session][:username].downcase)