Application/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "derik@gmail.com"]]
SELECT  "users".* FROM "users" WHERE (derik@gmail.com) LIMIT 1
INSERT INTO "users" ("username", "password_digest", "first", "last", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if /\A[^@\s]+@[^@\s]+\z/.match(@user.username) == nil
            flash[:notice] = "Invalid Username"
            redirect_to '/signup_organization'
        elsif User.find_by(username: @user.username)
            flash[:notice] = "Username already exists"
            redirect_to '/signup_organization'
        elsif @user.password.length < 8
            flash[:notice] = "Password length should be 8 or longer."
            redirect_to '/signup_organization'
        else @user.valid?
            @user = User.create(params.require(:user).permit(:first, :last, :username, :password))

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def edit
        @user = User.find_by_id(session[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2, "first" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$12$Cf8yX2GOLo9KSNyF8f2af.nyLP0Zx.88SZEd/5BS0mMUIHZ6hR6b."], ["updated_at", "2022-01-13 23:05:59.337836"], ["first", "Derik"], ["id", 7]]
---
    def update
        @user = User.find_by_id(session[:id])
        # user_params = params.require(:user).permit(:username, :password, :first, :last)
        @user.assign_attributes(params.require(:user).permit(:first, :last, :username, :password))
        if @user.changed?
            if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        @user = User.find_by_id(session[:id])
        Member.where(users_id: @user.id).update_all(users_id: nil)
        # @members.update_all(:users_id, nil)
        @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def show
        @user = User.find_by_id(session[:id])